import datetime
TOKEN = '7832749103:AAHdhP53JGJcwWe0xecZdqIxh_nFfLHkApM'
API_KEY = "d0f8f2fe6e5c4e3dac6103048252409"
CITY = "Karaganda,KZ"  
url = f"http://api.weatherapi.com/v1/current.json?key={API_KEY}&q={CITY}&lang=ru"

mini = '➖'*5
d = '➖'*14

numbers = {
    1: "1️⃣",
    2: "2️⃣",
    3: "3️⃣",
    4: "4️⃣",
    5: "5️⃣",
    6: "6️⃣",
    7: "7️⃣",
    8: "8️⃣",
    9: "9️⃣",
}

bell = {
1: ''' 
1️⃣ Пара  <b>08:00 – 09:30</b>

2️⃣ Пара  <b>09:45 – 11:15</b>

3️⃣ Пара  <b>11:30 – 13:00</b>

4️⃣ Пара  <b>13:15 – 14:45</b>

5️⃣ Пара  <b>15:00 – 16:30</b>

6️⃣ Пара  <b>16:45 – 18:15</b>''',

2:'''
Кураторский час <b>08:00 – 08:45</b>
1️⃣ Пара  <b>09:00 – 10:05</b>

2️⃣ Пара  <b>10:20 – 11:25</b>

3️⃣ Пара  <b>11:40 – 12:45</b>

Кураторский час <b>13:00 – 13:45</b>
4️⃣ Пара  <b>14:00 – 15:05</b>

5️⃣ Пара  <b>15:20 – 16:25</b>

6️⃣ Пара  <b>16:40 – 17:45</b>
''',
3: '''
1️⃣ Пара  <b>08:00 – 09:00</b>

2️⃣ Пара  <b>09:15 – 10:15</b>

3️⃣ Пара  <b>10:30 – 11:30</b>

4️⃣ Пара  <b>11:45 – 12:45</b>

5️⃣ Пара  <b>13:00 – 14:00</b>

6️⃣ Пара  <b>14:15 – 15:00</b>
'''
}
print(bell[3])

today = datetime.date.today()       
weekday_index = today.weekday()

days = {
    0: "ПОНЕДЕЛЬНИК - ДЕНЬ БЕЗДЕЛЬНИК",
    1: "ВТОРНИК - ПО ВТОРНИК",
    2: "СРЕДА - ТАМАДА",
    3: "ЧЕТВЕРГ - ВСЕ ЗАБОТЫ Я ОТВЕРГ",
    4: "ПЯТНИЦА - ПЬЯНИЦА",
    5: "СУББОТА - НЕ РАБОТА",
    6: "ВОСКРЕСЕНЬЕ - ДЕНЬ ВЕСЕЛИЯ"
}

schedule = [
    # Пн 0
    [   
        {"subject": "Физкультура", "room": "1 кб", "teacher": "Ишанкулова А.М"},
        {"subject": "Разработка интерфейсов", "room": "207 кб", "teacher": "Тюрибекова Д."},
        {"subject": "Компьютерная графика", "room": "104 кб", "teacher": "Жаксыбаев"},
    ],
    # Вт 1
    [   
        {"subject": "Web программирование", "room": "207 кб", "teacher": "Акедилова"},
        {"subject": "Разработка интерфейсов", "room": "207 кб", "teacher": "Тюрибекова Д."},
        {"subject": "Алгоритмизация", "room": "206 кб", "teacher": "Кузембаева"},
    ],
    # Ср 2
    [   
        {"subject": "Компьютерная графика", "room": "104 кб", "teacher": "Жаксыбаев"},
        {"subject": "Web программирование", "room": "207 кб", "teacher": "Акедилова"},
        {"subject": "Алгоритмизация", "room": "206 кб", "teacher": "Кузембаева"},
    ],
    # Чт 3
    [   
        {"subject": "Разработка интерфейсов", "room": "207 кб", "teacher": "Тюрибекова Д."},
        {"subject": "Web программирование", "room": "207 кб", "teacher": "Акедилова"},
        {"subject": "Физкультура", "room": "1 кб", "teacher": "Ишанкулова А.М"},
    ],
    # Пт 4
    [   
        {"subject": "Алгоритмизация", "room": "206 кб", "teacher": "Кузембаева"},
        {"subject": "Компьютерная графика", "room": "104 кб", "teacher": "Жаксыбаев"},
        {"subject": "Web программирование", "room": "207 кб", "teacher": "Акелова"},
    ],
    # Сб 5
    [   
        {"subject": "Программа 1С", "room": "203 кб", "teacher": "Крицкий"},
        {"subject": "Программа 1С", "room": "203 кб", "teacher": "Крицкий"},
        {"subject": "ООП (Объектно-ориентированное программирование)", "room": "203 кб", "teacher": "Абдрохманова"},
    ],
    # Вс 6
    [{"subject": "Литрбол", "room": "Геодезическая 8", "teacher": "Джейсон Стетхом"}]
]

